# Шла Маша по шоссе и сосала сушку
# Выведите используя переменную text и срезы следующие строки:
# 0. "по" (пример)
# 1. "Шла Маша"
# 2. "сосала сушку"
# 3. "Маша"
# 4. "Маша Шла"
# 5. "Маша сосала сушку и Шла по шоссе"
text = 'Шла Саша по шоссе и сосала сушку'
print(text)
print ('Всего символов в строке:' + ' ' + str (len(text)+1))
print('0.' + ' ' + text[9:11])
print ('1.' + ' ' + text [:8] )
print('2.' + ' ' + text [-12:])
print('3.' + ' ' + text [4:9])
print('4.' + ' ' + text [4:9] + text [:3])
print('5.' + ' ' + text [4:9] + text [-12:] + ' ' + text [-14:-12] + text [:3] + text [8:17])